Documents/бит_бу_ОплатаБиллинговыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_бу_ОплатаБиллинговыхУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_бу_НачисленияБиллинговыхУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлDBF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧекККМ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/бит_бу_НачисленияБиллинговыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_бу_НачисленияБиллинговыхУслуг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/бит_бу_ОплатаБиллинговыхУслуг/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

// БИТ_ЖКХ 22.09.2010. 
// Процедура выполняет распределение оплаты.
//
Процедура ВыполнитьРасчет(ТаблицаЛС = Неопределено, ОтборПоТекущейСтроке = Ложь)Экспорт
	
	Если ТаблицаЛС = Неопределено Тогда
		ТаблицаЛС = СписокЛС.Выгрузить();
	КонецЕсли; 
	
	БиллинговыеУслуги = СписокУслуг.ВыгрузитьКолонки();
	
	бит_РасчетыБиллинговыхУслуг.РаспределитьОплатуБиллинговыхУслуг(Дата, Организация, ТаблицаЛС, БиллинговыеУслуги);
	
	СписокУслуг.Очистить();
	СписокУслуг.Загрузить(БиллинговыеУслуги);
	
	КоличествоЗаписей = БиллинговыеУслуги.Количество();
	
	Для Ном = 1 По КоличествоЗаписей Цикл
		
		СтрокаТаблицы = БиллинговыеУслуги[КоличествоЗаписей - Ном];
		
		Если СтрокаТаблицы.Сумма = 0 Тогда
			
			БиллинговыеУслуги.Удалить(СтрокаТаблицы);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокУслуг.Сортировать("Приоритет Возр");
	
КонецПроцедуры

// БИТ_ЖКХ 22.09.2010. 
// Процедура выполняет заполнение счетов и субконто табличной части.
//
Процедура ЗапролнитьСчета() Экспорт
	
	тмпСписокЛС = СписокЛС.ВыгрузитьКолонку("ЛицевойСчет");
	Колонки     = СписокЛС.ВыгрузитьКолонки().Колонки;
	
	бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(СписокЛС, Колонки, тмпСписокЛС, Организация, Дата, ИсточникОплаты, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

//  Процедура выполняет проверку табличных частей при вводе оплаты вручную
//
Процедура ПроверкаОплатыВведнойВРучную(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокЛС.ЛицевойСчет,
	|	СписокЛС.ШаблонИзвещений,
	|	СписокЛС.Сумма
	|ПОМЕСТИТЬ ЛицевыеСчета
	|ИЗ
	|	&СписокЛС КАК СписокЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокУслуг.ЛицевойСчет,
	|	СписокУслуг.ШаблонИзвещений,
	|	СписокУслуг.Сумма
	|ПОМЕСТИТЬ СписокУслуг
	|ИЗ
	|	&СписокУслуг КАК СписокУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицевыеСчета.ЛицевойСчет,
	|	ЛицевыеСчета.ШаблонИзвещений,
	|	ЕСТЬNULL(ЛицевыеСчета.Сумма, 0) КАК СуммаОплаты,
	|	ЕСТЬNULL(Услуги.Сумма, 0) КАК СуммаРаспределения
	|ИЗ
	|	ЛицевыеСчета КАК ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СписокУслуг.ЛицевойСчет КАК ЛицевойСчет,
	|			СписокУслуг.ШаблонИзвещений КАК ШаблонИзвещений,
	|			СУММА(СписокУслуг.Сумма) КАК Сумма
	|		ИЗ
	|			СписокУслуг КАК СписокУслуг
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СписокУслуг.ЛицевойСчет,
	|			СписокУслуг.ШаблонИзвещений) КАК Услуги
	|		ПО ЛицевыеСчета.ЛицевойСчет = Услуги.ЛицевойСчет
	|			И ЛицевыеСчета.ШаблонИзвещений = Услуги.ШаблонИзвещений";
	
	Запрос.УстановитьПараметр("СписокЛС"   , СписокЛС);
	Запрос.УстановитьПараметр("СписокУслуг", СписокУслуг);
	
	Выборка = Запрос.Выполнить().Выбрать() ;
	
	Текст = "Сумма оплаты не совпадает с распределенной суммой: ";
	
	Пока Выборка.Следующий() Цикл
		
		СуммаОплаты = Выборка.СуммаОплаты;
		СуммаРасп   = Выборка.СуммаРаспределения;
		
		Если СуммаОплаты <> СуммаРасп Тогда
			
			Отказ = Истина;	
			Текст = Текст + "
			|Лицевой счет """+ Выборка.ЛицевойСчет +""", сумма оплаты: " + СуммаОплаты + ", распределенная сумма: " + СуммаРасп;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если Отказ Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить(Текст, СтатусСообщения.ОченьВажное);
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ) Экспорт
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
КонецПроцедуры

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Организация");
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура выполняет движения по регистрам.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоЛС, Отказ, Заголовок)
	
	ДатаДока = Дата;
	НачислениеПоУсл = Движения.бит_бу_НачисленияБиллинговыхУслуг;
	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
		
		Движение = НачислениеПоУсл.Добавить();
		Движение.ВидДвижения        = ВидДвиженияНакопления.Расход;
		Движение.Период             = ДатаДока;
		Движение.Организация        = СтруктураШапкиДокумента.Организация;
		Движение.ЛицевойСчет        = СтрокаТЧ.ЛицевойСчет;
		Движение.Услуга             = СтрокаТЧ.Услуга;
		Движение.Сумма              = СтрокаТЧ.Сумма;
		
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из ТаблицаПоЛС Цикл	
		
		Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда
			
			Проводка = Движения.Хозрасчетный.Добавить();
			мСумма = СтрокаТЧ.Сумма;
			Проводка.Период     = СтруктураШапкиДокумента.Дата;
			Проводка.Содержание = "Оплата КУ";
			Проводка.Организация = СтруктураШапкиДокумента.Организация;
			
			Проводка.СчетКт = СтрокаТЧ.СчетАбонента;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
			Проводка.СчетДт = СтрокаТЧ.СчетКУ;
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);
			Проводка.Сумма = мСумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Функция готовит таблицы документа для проведения.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//
// Возвращаемое значение:
//  СтруктураТаблиц - Структура.
//
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента)  Экспорт
	
	// СтруктураТаблиц.Вставить("<ИмяТабличнойЧасти>", ТаблицаПо<ИмяТабличнойЧасти>);
	СтруктураТаблиц = Новый Структура;
	
	Возврат СтруктураТаблиц;
	
КонецФункции // ПодготовитьТаблицыДокумента()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем СтруктураШапкиДокумента;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Подготовим структуру шапки документа.
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет" ,"ЛицевойСчет");
	СтруктураПолей.Вставить("Сумма"       ,"Сумма");
	
	СтруктураПолей.Вставить("СчетАбонента" ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"    ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"    ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"    ,"Субконто3");
	СтруктураПолей.Вставить("СчетКУ"       ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"  ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"  ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"  ,"СубконтоКУ3");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокЛС", СтруктураПолей);
	ТаблицаПоЛС               = РезультатЗапросаПоУслугам.Выгрузить();
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"      ,"ЛицевойСчет");
	СтруктураПолей.Вставить("Услуга"           ,"Услуга");
	СтруктураПолей.Вставить("Сумма"            ,"Сумма");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокУслуг", СтруктураПолей);
	ТаблицаПоУслугам          = РезультатЗапросаПоУслугам.Выгрузить();
	
	Если ВводВРучную Тогда
		
		ПроверкаОплатыВведнойВРучную(Отказ);	
		
	КонецЕсли;
	
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоЛС, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка, Ложь);
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТЗСписокЛС = СписокЛС.Выгрузить(,"ЛицевойСчет");
	Для каждого Строка Из СписокУслуг Цикл
		
		НоваяСтрока =  ТЗСписокЛС.Добавить();
		НоваяСтрока.ЛицевойСчет = Строка.ЛицевойСчет;
		
	КонецЦикла; 
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
		Иначе
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 07.02.2014
	// Бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,глЗначениеПеременной("глТекущийПользователь"));
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	// БИТ_ЖКХ 07.02.2014
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
